Tekla Open API Reference for Tekla Structures 2025
ProfileCatalog Events
The ProfileCatalog type exposes the following members.
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the profile selection dialog is closed.
Top
See Also
Reference
ProfileCatalog Class
Tekla.Structures.Dialog.UIControls Namespace